test/request-response-samples/complexType_request/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tns="http://3e.pl/ADInterface">
   <soapenv:Header/>
   <soapenv:Body>
      <tns:createData>
         <tns:ModelCRUDRequest>
            <ModelCRUD>
               <serviceType>CreateInterest</serviceType>
               <TableName>WTC_EmployeeInterest</TableName>
               <RecordID>0</RecordID>
               <Filter></Filter>
               <Action>Create</Action>
               <!--Optional:-->
               <DataRow>
                  <!--Zero or more repetitions:-->
                  <tns:field column="C_BPartner_ID" >
                     <val>100407</val>
                  </tns:field>
                  <tns:field column="Interest" >
                     <val>Coocking</val>
                  </tns:field>
               </DataRow>
            </ModelCRUD>
            <ADLoginRequest>
               <user>1213</user>
               <pass>3423</pass>
               <lang>19</lang>
               <ClientID>11</ClientID>
               <RoleID>34</RoleID>
               <OrgID>1</OrgID>
               <WarehouseID>12</WarehouseID>
               <stage>0</stage>
            </ADLoginRequest>
         </tns:ModelCRUDRequest>
      </tns:createData>
   </soapenv:Body>
</soapenv:Envelope>
